# Pandas Assignment: 50 Basic Questions

Dataset Columns: CID, TID, Gender, Age Group, Purchase Date, Product Category, Discount Availed, Discount Name, Discount Amount (INR), Gross Amount, Net Amount, Purchase Method, Location

### 1. Load the CSV file into a Pandas DataFrame.

In [47]:
import pandas as pd

df = pd.read_csv("FILE:///A:/Big Data JOBJACK/python_tut/datasets/Retail_Purchase_Dataset.csv")

df

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
0,943146,5876328741,Female,25-45,30/08/2023 20:27:08,Electronics,Yes,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
2,337580,3814082218,Other,60 and above,06/03/2022 09:09:50,Clothing,Yes,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi
3,180333,1395204173,Other,60 and above,04/11/2020 04:41:57,Sports & Fitness,No,NaN,0.00,5695.612650,5695.612650,Debit Card,Delhi
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,Yes,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54995,295864,5407639888,Other,25-45,23/02/2020 10:42:04,Electronics,Yes,SEASONALOFFER21,110.89,2819.907300,2709.017300,Debit Card,Other
54996,706435,1144029904,Other,18-25,12/07/2021 15:59:21,Electronics,Yes,SEASONALOFFER21,488.59,3891.303900,3402.713900,Cash on Delivery,Bangalore
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,Yes,NEWYEARS,417.63,4094.687500,3677.057500,Credit Card,Mumbai
54998,982183,5032564481,Female,45-60,05/08/2020 23:57:56,Beauty and Health,Yes,SEASONALOFFER21,204.56,3977.473500,3772.913500,Credit Card,Kolkata
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,Yes,NEWYEARS,380.81,3703.581900,3322.771900,Credit Card,Mumbai

### 2. Display the first 5 rows.

In [6]:
df.head(5)

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
0,943146,5876328741,Female,25-45,30/08/2023 20:27:08,Electronics,Yes,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
2,337580,3814082218,Other,60 and above,06/03/2022 09:09:50,Clothing,Yes,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi
3,180333,1395204173,Other,60 and above,04/11/2020 04:41:57,Sports & Fitness,No,NaN,0.00,5695.612650,5695.612650,Debit Card,Delhi
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,Yes,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi

### 3. Display the last 5 rows.

In [7]:
df.tail(5)

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
54995,295864,5407639888,Other,25-45,23/02/2020 10:42:04,Electronics,Yes,SEASONALOFFER21,110.89,2819.9073,2709.0173,Debit Card,Other
54996,706435,1144029904,Other,18-25,12/07/2021 15:59:21,Electronics,Yes,SEASONALOFFER21,488.59,3891.3039,3402.7139,Cash on Delivery,Bangalore
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,Yes,NEWYEARS,417.63,4094.6875,3677.0575,Credit Card,Mumbai
54998,982183,5032564481,Female,45-60,05/08/2020 23:57:56,Beauty and Health,Yes,SEASONALOFFER21,204.56,3977.4735,3772.9135,Credit Card,Kolkata
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,Yes,NEWYEARS,380.81,3703.5819,3322.7719,Credit Card,Mumbai

### 4. Print the shape of the DataFrame.

In [9]:
df.shape

(55000, 13)

### 5. Show all column names.

In [13]:
list(df.columns)

['CID',
 'TID',
 'Gender',
 'Age Group',
 'Purchase Date',
 'Product Category',
 'Discount Availed',
 'Discount Name',
 'Discount Amount (INR)',
 'Gross Amount',
 'Net Amount',
 'Purchase Method',
 'Location']

### 6. Display the data types of each column.

In [14]:
df.dtypes

CID                        int64
TID                        int64
Gender                    object
Age Group                 object
Purchase Date             object
Product Category          object
Discount Availed          object
Discount Name             object
Discount Amount (INR)    float64
Gross Amount             float64
Net Amount               float64
Purchase Method           object
Location                  object
dtype: object

### 7. Check for missing values in each column.

In [19]:
df.isna().sum()

CID                          0
TID                          0
Gender                       0
Age Group                    0
Purchase Date                0
Product Category             0
Discount Availed             0
Discount Name            27585
Discount Amount (INR)        0
Gross Amount                 0
Net Amount                   0
Purchase Method              0
Location                     0
dtype: int64

### 8. Count total missing values in the dataset.

In [20]:
df.isna().sum().sum()

np.int64(27585)

### 9. Show summary statistics for numeric columns.

In [21]:
df.describe()

,CID,TID,Discount Amount (INR),Gross Amount,Net Amount
count,55000.000000,5.500000e+04,55000.000000,55000.000000,55000.000000
mean,551245.593891,5.504740e+09,136.986796,3012.936606,2875.949810
std,260603.330337,2.594534e+09,165.375502,1718.431066,1726.127778
min,100009.000000,1.000163e+09,0.000000,136.454325,-351.119775
25%,323717.000000,3.252604e+09,0.000000,1562.111325,1429.551863
50%,550088.500000,5.498383e+09,0.000000,2954.266150,2814.910875
75%,776955.750000,7.747933e+09,274.115000,4342.221675,4211.407838
max,999996.000000,9.999393e+09,500.000000,8394.825600,8394.825600

### 10. Display info about the DataFrame using .info().

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55000 entries, 0 to 54999
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   CID                    55000 non-null  int64
 1   TID                    55000 non-null  int64
 2   Gender                 55000 non-null  object
 3   Age Group              55000 non-null  object
 4   Purchase Date          55000 non-null  object
 5   Product Category       55000 non-null  object
 6   Discount Availed       55000 non-null  object
 7   Discount Name          27415 non-null  object
 8   Discount Amount (INR)  55000 non-null  float64
 9   Gross Amount           55000 non-null  float64
 10  Net Amount             55000 non-null  float64
 11  Purchase Method        55000 non-null  object
 12  Location               55000 non-null  object
dtypes: float64(3), int64(2), object(8)
memory usage: 5.5+ MB

### 11. Select the CID and TID columns.

In [29]:
cid_tid_df = df[['CID','TID']]
cid_tid_df

          CID         TID
0      943146  5876328741
1      180079  1018503182
2      337580  3814082218
3      180333  1395204173
4      447553  8009390577
...       ...         ...
54995  295864  5407639888
54996  706435  1144029904
54997  649435  9587323189
54998  982183  5032564481
54999  126691  9172953722

[55000 rows x 2 columns]

### 12. Display the first 10 rows of Gender and Age Group.

In [ ]:
df[['Gender','Age Group']].head(10)

   Gender     Age Group
0  Female         25-45
1    Male         25-45
2   Other  60 and above
3   Other  60 and above
4    Male         18-25
5    Male         18-25
6    Male         25-45
7  Female         18-25
8    Male         18-25
9   Other  60 and above

### 13. Filter rows where Gender is 'Male'.

In [37]:
df[df['Gender']=='Male']

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,Yes,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi
5,200614,3994452858,Male,18-25,12/07/2021 15:10:27,Clothing,Yes,FESTIVE50,127.01,3649.397400,3522.387400,Credit Card,Delhi
6,668787,9460023916,Male,25-45,08/10/2023 16:59:52,Electronics,No,NaN,0.00,5593.935600,5593.935600,PhonePe UPI,Delhi
8,414167,2841266620,Male,18-25,29/04/2020 09:10:46,Pet Care,No,NaN,0.00,3961.671000,3961.671000,Debit Card,Delhi
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54989,812597,3862962312,Male,45-60,07/08/2022 11:42:13,Clothing,No,NaN,0.00,2335.098000,2335.098000,Credit Card,Pune
54990,180783,4001403523,Male,25-45,06/08/2024 23:15:21,Home & Kitchen,No,NaN,0.00,2679.337500,2679.337500,Credit Card,Delhi
54992,639165,8525877571,Male,25-45,15/05/2022 20:32:26,Electronics,No,NaN,0.00,4489.956500,4489.956500,Credit Card,Kolkata
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,Yes,NEWYEARS,417.63,4094.687500,3677.057500,Credit Card,Mumbai
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,Yes,NEWYEARS,380.81,3703.581900,3322.771900,Credit Card,Mumbai

### 14. Filter rows where Age Group is '26-35'.

In [46]:
df[df['Age Group'] == "26-35"]

Empty DataFrame
Columns: [CID, TID, Gender, Age Group, Purchase Date, Product Category, Discount Availed, Discount Name, Discount Amount (INR), Gross Amount, Net Amount, Purchase Method, Location]
Index: []

### 15. Filter rows where Discount Availed is 'Yes'.

In [49]:
df[df['Discount Availed']=='Yes']

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
0,943146,5876328741,Female,25-45,30/08/2023 20:27:08,Electronics,Yes,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
2,337580,3814082218,Other,60 and above,06/03/2022 09:09:50,Clothing,Yes,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,Yes,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi
5,200614,3994452858,Male,18-25,12/07/2021 15:10:27,Clothing,Yes,FESTIVE50,127.01,3649.397400,3522.387400,Credit Card,Delhi
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54995,295864,5407639888,Other,25-45,23/02/2020 10:42:04,Electronics,Yes,SEASONALOFFER21,110.89,2819.907300,2709.017300,Debit Card,Other
54996,706435,1144029904,Other,18-25,12/07/2021 15:59:21,Electronics,Yes,SEASONALOFFER21,488.59,3891.303900,3402.713900,Cash on Delivery,Bangalore
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,Yes,NEWYEARS,417.63,4094.687500,3677.057500,Credit Card,Mumbai
54998,982183,5032564481,Female,45-60,05/08/2020 23:57:56,Beauty and Health,Yes,SEASONALOFFER21,204.56,3977.473500,3772.913500,Credit Card,Kolkata
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,Yes,NEWYEARS,380.81,3703.581900,3322.771900,Credit Card,Mumbai

### 16. Filter rows where Discount Amount (INR) > 500.

In [53]:
df[df['Discount Amount (INR)'] > 500]

Empty DataFrame
Columns: [CID, TID, Gender, Age Group, Purchase Date, Product Category, Discount Availed, Discount Name, Discount Amount (INR), Gross Amount, Net Amount, Purchase Method, Location]
Index: []

### 17. Filter rows where Product Category is 'Electronics'.

In [56]:
df[df['Product Category'] == 'Electronics']

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
0,943146,5876328741,Female,25-45,30/08/2023 20:27:08,Electronics,Yes,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
6,668787,9460023916,Male,25-45,08/10/2023 16:59:52,Electronics,No,NaN,0.00,5593.935600,5593.935600,PhonePe UPI,Delhi
7,933551,6877673032,Female,18-25,14/12/2022 20:13:45,Electronics,No,NaN,0.00,1901.796400,1901.796400,Credit Card,Delhi
11,629298,2229511931,Other,45-60,02/11/2021 15:37:38,Electronics,No,NaN,0.00,988.172900,988.172900,Google Pay UPI,Chennai
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54985,903683,2516034122,Female,25-45,22/03/2024 23:52:20,Electronics,Yes,NEWYEARS,456.01,4733.826250,4277.816250,Paytm UPI,Mumbai
54987,907365,2841576857,Male,25-45,12/05/2023 15:48:26,Electronics,No,NaN,0.00,927.384000,927.384000,Debit Card,Bangalore
54992,639165,8525877571,Male,25-45,15/05/2022 20:32:26,Electronics,No,NaN,0.00,4489.956500,4489.956500,Credit Card,Kolkata
54995,295864,5407639888,Other,25-45,23/02/2020 10:42:04,Electronics,Yes,SEASONALOFFER21,110.89,2819.907300,2709.017300,Debit Card,Other
54996,706435,1144029904,Other,18-25,12/07/2021 15:59:21,Electronics,Yes,SEASONALOFFER21,488.59,3891.303900,3402.713900,Cash on Delivery,Bangalore

### 18. Display rows where Purchase Method is 'Credit Card'.

In [58]:
df[df['Purchase Method']=='Credit Card']

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
0,943146,5876328741,Female,25-45,30/08/2023 20:27:08,Electronics,Yes,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
2,337580,3814082218,Other,60 and above,06/03/2022 09:09:50,Clothing,Yes,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,Yes,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi
5,200614,3994452858,Male,18-25,12/07/2021 15:10:27,Clothing,Yes,FESTIVE50,127.01,3649.397400,3522.387400,Credit Card,Delhi
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54991,103234,5584476454,Other,45-60,29/08/2021 18:47:25,Other,No,NaN,0.00,2385.438000,2385.438000,Credit Card,Bangalore
54992,639165,8525877571,Male,25-45,15/05/2022 20:32:26,Electronics,No,NaN,0.00,4489.956500,4489.956500,Credit Card,Kolkata
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,Yes,NEWYEARS,417.63,4094.687500,3677.057500,Credit Card,Mumbai
54998,982183,5032564481,Female,45-60,05/08/2020 23:57:56,Beauty and Health,Yes,SEASONALOFFER21,204.56,3977.473500,3772.913500,Credit Card,Kolkata
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,Yes,NEWYEARS,380.81,3703.581900,3322.771900,Credit Card,Mumbai

### 19. Select rows where Location is 'Mumbai'.

In [59]:
df[df['Location']=='Mumbai']

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
19,787512,9582806381,Male,18-25,17/03/2021 17:32:46,Books,No,NaN,0.00,1952.41530,1952.41530,Paytm UPI,Mumbai
20,538174,1322344974,Male,60 and above,24/11/2020 02:42:48,Sports & Fitness,No,NaN,0.00,5025.71160,5025.71160,Net Banking,Mumbai
22,443120,4473452038,Female,under 18,07/09/2023 23:23:03,Sports & Fitness,Yes,NEWYEARS,268.54,1495.20420,1226.66420,Debit Card,Mumbai
24,745014,9202622469,Male,18-25,04/05/2023 18:06:02,Clothing,Yes,SAVE10,75.72,3579.91200,3504.19200,Credit Card,Mumbai
26,654718,6758404906,Other,under 18,22/07/2023 23:26:04,Beauty and Health,No,NaN,0.00,5057.99640,5057.99640,Debit Card,Mumbai
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54983,306954,1846818218,Female,18-25,13/09/2023 06:55:26,Sports & Fitness,No,NaN,0.00,892.99980,892.99980,PhonePe UPI,Mumbai
54985,903683,2516034122,Female,25-45,22/03/2024 23:52:20,Electronics,Yes,NEWYEARS,456.01,4733.82625,4277.81625,Paytm UPI,Mumbai
54986,915197,5506311767,Female,25-45,06/03/2023 15:57:05,Clothing,Yes,SEASONALOFFER21,489.26,2425.12200,1935.86200,Cash on Delivery,Mumbai
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,Yes,NEWYEARS,417.63,4094.68750,3677.05750,Credit Card,Mumbai
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,Yes,NEWYEARS,380.81,3703.58190,3322.77190,Credit Card,Mumbai

### 20. Select rows where Gross Amount is between 1000 and 5000.

In [62]:
df[df['Gross Amount'].between(1000,5000)]

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
2,337580,3814082218,Other,60 and above,06/03/2022 09:09:50,Clothing,Yes,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,Yes,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi
5,200614,3994452858,Male,18-25,12/07/2021 15:10:27,Clothing,Yes,FESTIVE50,127.01,3649.397400,3522.387400,Credit Card,Delhi
7,933551,6877673032,Female,18-25,14/12/2022 20:13:45,Electronics,No,NaN,0.00,1901.796400,1901.796400,Credit Card,Delhi
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54995,295864,5407639888,Other,25-45,23/02/2020 10:42:04,Electronics,Yes,SEASONALOFFER21,110.89,2819.907300,2709.017300,Debit Card,Other
54996,706435,1144029904,Other,18-25,12/07/2021 15:59:21,Electronics,Yes,SEASONALOFFER21,488.59,3891.303900,3402.713900,Cash on Delivery,Bangalore
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,Yes,NEWYEARS,417.63,4094.687500,3677.057500,Credit Card,Mumbai
54998,982183,5032564481,Female,45-60,05/08/2020 23:57:56,Beauty and Health,Yes,SEASONALOFFER21,204.56,3977.473500,3772.913500,Credit Card,Kolkata
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,Yes,NEWYEARS,380.81,3703.581900,3322.771900,Credit Card,Mumbai

### 21. Sort the DataFrame by Gross Amount ascending.

In [72]:
df.sort_values(by='Gross Amount', ascending=True)

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
37352,570046,1964089589,Female,25-45,18/02/2020 02:14:13,Beauty and Health,No,NaN,0.00,136.454325,136.454325,Credit Card,Varanasi
17568,262070,5537538360,Female,under 18,01/02/2020 00:15:47,Electronics,Yes,NEWYEARS,429.60,138.890850,-290.709150,Credit Card,Mumbai
38606,481252,9891577351,Female,25-45,03/02/2020 07:18:59,Clothing,Yes,SEASONALOFFER21,413.14,140.461650,-272.678350,Google Pay UPI,Hyderabad
40677,376537,8659700479,Female,25-45,14/01/2020 19:49:31,Clothing,No,NaN,0.00,141.957900,141.957900,Google Pay UPI,Varanasi
48164,386840,8029271119,Female,18-25,20/02/2020 14:18:22,Electronics,Yes,NEWYEARS,352.96,142.077075,-210.882925,Credit Card,Ahmedabad
...,...,...,...,...,...,...,...,...,...,...,...,...,...
52533,675956,7090926391,Female,under 18,01/12/2023 07:55:47,Electronics,Yes,SEASONALOFFER21,214.33,8334.009600,8119.679600,Debit Card,Chennai
5521,255607,7392860072,Male,18-25,15/12/2023 15:55:16,Clothing,No,NaN,0.00,8361.225600,8361.225600,Credit Card,Mumbai
29249,871976,7829441574,Female,25-45,19/12/2023 09:49:50,Toys & Games,Yes,FESTIVE50,492.56,8365.190400,7872.630400,Net Banking,Delhi
21848,738513,7204773289,Female,18-25,06/12/2023 04:26:33,Beauty and Health,No,NaN,0.00,8382.796800,8382.796800,Debit Card,Delhi
26874,202767,5202191880,Other,18-25,11/12/2023 11:19:48,Home & Kitchen,No,NaN,0.00,8394.825600,8394.825600,Debit Card,Pune

### 22. Sort the DataFrame by Net Amount descending.

In [74]:
df.sort_values(by='Net Amount', ascending=False)

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
26874,202767,5202191880,Other,18-25,11/12/2023 11:19:48,Home & Kitchen,No,NaN,0.00,8394.825600,8394.825600,Debit Card,Pune
21848,738513,7204773289,Female,18-25,06/12/2023 04:26:33,Beauty and Health,No,NaN,0.00,8382.796800,8382.796800,Debit Card,Delhi
5521,255607,7392860072,Male,18-25,15/12/2023 15:55:16,Clothing,No,NaN,0.00,8361.225600,8361.225600,Credit Card,Mumbai
46212,327575,7133917620,Other,under 18,02/12/2023 07:47:56,Clothing,No,NaN,0.00,8309.767200,8309.767200,Credit Card,Ahmedabad
27657,433217,1340357202,Male,45-60,21/12/2023 12:16:26,Electronics,No,NaN,0.00,8238.535200,8238.535200,Credit Card,Bangalore
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16031,574966,9576162844,Female,25-45,30/01/2023 00:53:06,Electronics,Yes,SEASONALOFFER21,482.13,171.871200,-310.258800,Credit Card,Ahmedabad
2606,472724,2853800882,Other,18-25,03/04/2020 16:08:07,Clothing,Yes,SEASONALOFFER21,495.73,182.731500,-312.998500,Credit Card,Bangalore
22138,761286,3119749374,Male,45-60,15/06/2022 12:08:59,Clothing,Yes,NEWYEARS,485.12,159.089850,-326.030150,Credit Card,Pune
7152,717101,8220478366,Male,25-45,10/02/2022 22:38:06,Electronics,Yes,SAVE10,491.35,164.757625,-326.592375,Credit Card,Mumbai
18827,898531,4861274119,Other,45-60,23/02/2020 05:26:39,Electronics,Yes,SEASONALOFFER21,494.25,143.130225,-351.119775,Credit Card,Bangalore

### 23. Sort by Location and then by Purchase Date.

In [ ]:
df.sort_values(by=['Location','Purchase Date'],ascending=[True,True])

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
14677,356972,9481824682,Female,25-45,01/01/2020 16:36:35,Books,Yes,SAVE10,81.76,4201.6968,4119.9368,Debit Card,Ahmedabad
52154,291523,3456432695,Other,25-45,01/01/2020 19:55:04,Sports & Fitness,No,NaN,0.00,1121.9418,1121.9418,Cash on Delivery,Ahmedabad
36766,636294,8503669581,Female,25-45,01/01/2021 10:36:31,Toys & Games,Yes,NEWYEARS,457.49,3911.0544,3453.5644,International Card,Ahmedabad
47676,582716,7455858410,Other,25-45,01/01/2022 03:01:35,Clothing,No,NaN,0.00,4558.0779,4558.0779,Paytm UPI,Ahmedabad
26695,380678,4378851841,Male,25-45,01/01/2022 07:47:24,Clothing,Yes,SEASONALOFFER21,138.82,1121.6502,982.8302,Credit Card,Ahmedabad
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8966,298020,1127367408,Male,25-45,31/08/2023 16:58:41,Electronics,Yes,NEWYEARS,294.44,5206.6440,4912.2040,Debit Card,Varanasi
4011,502349,3964650442,Female,18-25,31/08/2024 03:59:17,Beauty and Health,Yes,SEASONALOFFER21,383.84,1208.3375,824.4975,Credit Card,Varanasi
24671,374505,8692673674,Female,25-45,31/08/2024 11:51:32,Other,Yes,SAVE10,316.20,3370.3000,3054.1000,Credit Card,Varanasi
50120,486244,2152632978,Female,25-45,31/10/2019 13:34:58,Other,No,NaN,0.00,2197.7120,2197.7120,Credit Card,Varanasi
48865,502580,6251204383,Male,60 and above,31/12/2023 09:50:47,Clothing,Yes,SEASONALOFFER21,57.98,4926.7512,4868.7712,Debit Card,Varanasi

### 24. Find the number of unique locations.

In [92]:
df['Location'].nunique()

14

### 25. Display all unique locations.

In [94]:
list(df['Location'].unique())

['Ahmedabad',
 'Bangalore',
 'Delhi',
 'Other',
 'Chennai',
 'Dehradun',
 'Pune',
 'Hyderabad',
 'Mumbai',
 'Jaipur',
 'Lucknow',
 'Kolkata',
 'Srinagar',
 'Varanasi']

### 26. Find the number of unique product categories.

In [98]:
df['Product Category'].nunique()

9

### 27. Display the top 10 most frequent product categories.

In [106]:
df['Product Category'].value_counts().head(10)

Product Category
Electronics          16574
Clothing             10968
Beauty and Health     8332
Sports & Fitness      5557
Home & Kitchen        5489
Books                 2762
Other                 2171
Pet Care              1618
Toys & Games          1529
Name: count, dtype: int64

### 28. Display the top 10 most frequent locations.

In [110]:
df['Location'].value_counts().head(10)

Location
Mumbai       11197
Delhi        10799
Bangalore     8249
Hyderabad     5545
Chennai       4368
Pune          3781
Ahmedabad     2785
Kolkata       2709
Jaipur        1678
Lucknow       1136
Name: count, dtype: int64

### 29. Find the transaction with the highest Gross Amount.

In [119]:

df.loc[df['Gross Amount'].idxmax(),'TID']

np.int64(5202191880)

### 30. Find the transaction with the highest Discount Amount (INR).

In [122]:
df.loc[df['Discount Amount (INR)'].idxmax(),'TID']

np.int64(8375499682)

### 31. Create a new column Discount Percentage = (Discount Amount / Gross Amount) * 100.

In [49]:
df['Discount Percentage'] = (df['Discount Amount (INR)'] / df['Gross Amount']) * 100

df.head(5)

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location,Discount Percentage
0,943146,5876328741,Female,25-45,30/08/2023 20:27:08,Electronics,Yes,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad,8.865248
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore,3.776467
2,337580,3814082218,Other,60 and above,06/03/2022 09:09:50,Clothing,Yes,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi,10.649563
3,180333,1395204173,Other,60 and above,04/11/2020 04:41:57,Sports & Fitness,No,No Discount,0.00,5695.612650,5695.612650,Debit Card,Delhi,0.000000
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,Yes,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi,19.188263

### 32. Round Discount Percentage to 2 decimal places.

In [134]:
df[['Discount Percentage']].round(2)

       Discount Percentage
0                     8.87
1                     3.78
2                    10.65
3                     0.00
4                    19.19
...                    ...
54995                 3.93
54996                12.56
54997                10.20
54998                 5.14
54999                10.28

[55000 rows x 1 columns]

### 33. Convert Product Category to uppercase.

In [140]:
df['Product Category']  = df['Product Category'].str.upper()
df[['Product Category']]

        Product Category
0            ELECTRONICS
1            ELECTRONICS
2               CLOTHING
3       SPORTS & FITNESS
4       SPORTS & FITNESS
...                  ...
54995        ELECTRONICS
54996        ELECTRONICS
54997     HOME & KITCHEN
54998  BEAUTY AND HEALTH
54999  BEAUTY AND HEALTH

[55000 rows x 1 columns]

### 34. Remove leading/trailing spaces from Discount Name.

In [5]:
df['Discount Name'].str.strip()

0              FESTIVE50
1        SEASONALOFFER21
2        SEASONALOFFER21
3                    NaN
4               WELCOME5
              ...
54995    SEASONALOFFER21
54996    SEASONALOFFER21
54997           NEWYEARS
54998    SEASONALOFFER21
54999           NEWYEARS
Name: Discount Name, Length: 55000, dtype: object

### 35. Replace missing Discount Name with 'No Discount'.

In [48]:
df['Discount Name'].fillna("No Discount",inplace=True)
df

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Availed,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location
0,943146,5876328741,Female,25-45,30/08/2023 20:27:08,Electronics,Yes,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,Yes,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
2,337580,3814082218,Other,60 and above,06/03/2022 09:09:50,Clothing,Yes,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi
3,180333,1395204173,Other,60 and above,04/11/2020 04:41:57,Sports & Fitness,No,No Discount,0.00,5695.612650,5695.612650,Debit Card,Delhi
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,Yes,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi
...,...,...,...,...,...,...,...,...,...,...,...,...,...
54995,295864,5407639888,Other,25-45,23/02/2020 10:42:04,Electronics,Yes,SEASONALOFFER21,110.89,2819.907300,2709.017300,Debit Card,Other
54996,706435,1144029904,Other,18-25,12/07/2021 15:59:21,Electronics,Yes,SEASONALOFFER21,488.59,3891.303900,3402.713900,Cash on Delivery,Bangalore
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,Yes,NEWYEARS,417.63,4094.687500,3677.057500,Credit Card,Mumbai
54998,982183,5032564481,Female,45-60,05/08/2020 23:57:56,Beauty and Health,Yes,SEASONALOFFER21,204.56,3977.473500,3772.913500,Credit Card,Kolkata
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,Yes,NEWYEARS,380.81,3703.581900,3322.771900,Credit Card,Mumbai

### 36. Drop the Discount Availed column.

In [160]:
df.columns

Index(['CID', 'TID', 'Gender', 'Age Group', 'Purchase Date',
       'Product Category', 'Discount Availed', 'Discount Name',
       'Discount Amount (INR)', 'Gross Amount', 'Net Amount',
       'Purchase Method', 'Location'],
      dtype='object')

In [6]:
df.drop(columns=['Discount Availed'],inplace=True)

### 37. Rename Purchase Method column to PaymentMethod.

In [165]:
df.rename(columns={'Purchase Method':'PaymentMethod'},inplace=True)
df

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,PaymentMethod,Location
0,943146,5876328741,Female,25-45,30/08/2023 20:27:08,Electronics,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad
1,180079,1018503182,Male,25-45,23/02/2024 09:33:46,Electronics,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore
2,337580,3814082218,Other,60 and above,06/03/2022 09:09:50,Clothing,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi
3,180333,1395204173,Other,60 and above,04/11/2020 04:41:57,Sports & Fitness,NaN,0.00,5695.612650,5695.612650,Debit Card,Delhi
4,447553,8009390577,Male,18-25,31/05/2022 17:00:32,Sports & Fitness,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi
...,...,...,...,...,...,...,...,...,...,...,...,...
54995,295864,5407639888,Other,25-45,23/02/2020 10:42:04,Electronics,SEASONALOFFER21,110.89,2819.907300,2709.017300,Debit Card,Other
54996,706435,1144029904,Other,18-25,12/07/2021 15:59:21,Electronics,SEASONALOFFER21,488.59,3891.303900,3402.713900,Cash on Delivery,Bangalore
54997,649435,9587323189,Male,45-60,02/08/2024 09:30:44,Home & Kitchen,NEWYEARS,417.63,4094.687500,3677.057500,Credit Card,Mumbai
54998,982183,5032564481,Female,45-60,05/08/2020 23:57:56,Beauty and Health,SEASONALOFFER21,204.56,3977.473500,3772.913500,Credit Card,Kolkata
54999,126691,9172953722,Male,25-45,21/07/2022 09:05:18,Beauty and Health,NEWYEARS,380.81,3703.581900,3322.771900,Credit Card,Mumbai

### 38. Reorder columns so CID and TID come first.

In [42]:
df = df[['CID','TID'] + list(df.columns.drop(['CID','TID']))]
df

,CID,TID,Gender,Age Group,Purchase Date,Product Category,Discount Name,Discount Amount (INR),Gross Amount,Net Amount,Purchase Method,Location,Year,Month,Day
0,943146,5876328741,Female,25-45,2023-08-30 20:27:08,Electronics,FESTIVE50,64.30,725.304000,661.004000,Credit Card,Ahmedabad,2023,8,30
1,180079,1018503182,Male,25-45,2024-02-23 09:33:46,Electronics,SEASONALOFFER21,175.19,4638.991875,4463.801875,Credit Card,Bangalore,2024,2,23
2,337580,3814082218,Other,60 and above,2022-03-06 09:09:50,Clothing,SEASONALOFFER21,211.54,1986.372575,1774.832575,Credit Card,Delhi,2022,3,6
3,180333,1395204173,Other,60 and above,2020-11-04 04:41:57,Sports & Fitness,NaN,0.00,5695.612650,5695.612650,Debit Card,Delhi,2020,11,4
4,447553,8009390577,Male,18-25,2022-05-31 17:00:32,Sports & Fitness,WELCOME5,439.92,2292.651500,1852.731500,Credit Card,Delhi,2022,5,31
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
54995,295864,5407639888,Other,25-45,2020-02-23 10:42:04,Electronics,SEASONALOFFER21,110.89,2819.907300,2709.017300,Debit Card,Other,2020,2,23
54996,706435,1144029904,Other,18-25,2021-07-12 15:59:21,Electronics,SEASONALOFFER21,488.59,3891.303900,3402.713900,Cash on Delivery,Bangalore,2021,7,12
54997,649435,9587323189,Male,45-60,2024-08-02 09:30:44,Home & Kitchen,NEWYEARS,417.63,4094.687500,3677.057500,Credit Card,Mumbai,2024,8,2
54998,982183,5032564481,Female,45-60,2020-08-05 23:57:56,Beauty and Health,SEASONALOFFER21,204.56,3977.473500,3772.913500,Credit Card,Kolkata,2020,8,5
54999,126691,9172953722,Male,25-45,2022-07-21 09:05:18,Beauty and Health,NEWYEARS,380.81,3703.581900,3322.771900,Credit Card,Mumbai,2022,7,21

### 39. Check if TID column has duplicates.

In [12]:
df['TID'].duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
54995    False
54996    False
54997    False
54998    False
54999    False
Name: TID, Length: 55000, dtype: bool

### 40. Drop duplicate rows based on TID.

In [40]:
df.drop_duplicates(subset=['TID'], keep='first', inplace=True)
df[['TID']]

              TID
0      5876328741
1      1018503182
2      3814082218
3      1395204173
4      8009390577
...           ...
54995  5407639888
54996  1144029904
54997  9587323189
54998  5032564481
54999  9172953722

[55000 rows x 1 columns]

### 41. Convert Purchase Date to datetime format.

In [18]:
df['Purchase Date'] = pd.to_datetime(df['Purchase Date'],dayfirst=True)

### 42. Convert CID to integer type (handle missing values first).

In [39]:
df['CID'] = df['CID'].fillna(0).astype(int)
df[['CID']]

          CID
0      943146
1      180079
2      337580
3      180333
4      447553
...       ...
54995  295864
54996  706435
54997  649435
54998  982183
54999  126691

[55000 rows x 1 columns]

### 43. Convert Discount Amount (INR) to float type.

In [28]:
df['Discount Amount (INR)'] = df['Discount Amount (INR)'].astype(float)
df['Discount Amount (INR)']

0         64.30
1        175.19
2        211.54
3          0.00
4        439.92
          ...
54995    110.89
54996    488.59
54997    417.63
54998    204.56
54999    380.81
Name: Discount Amount (INR), Length: 55000, dtype: float64

### 44. Convert Gross Amount and Net Amount to float type.

In [27]:
df[['Gross Amount', 'Net Amount']] = df[['Gross Amount', 'Net Amount']].astype(float)
df[['Gross Amount', 'Net Amount']]

       Gross Amount   Net Amount
0        725.304000   661.004000
1       4638.991875  4463.801875
2       1986.372575  1774.832575
3       5695.612650  5695.612650
4       2292.651500  1852.731500
...             ...          ...
54995   2819.907300  2709.017300
54996   3891.303900  3402.713900
54997   4094.687500  3677.057500
54998   3977.473500  3772.913500
54999   3703.581900  3322.771900

[55000 rows x 2 columns]

### 45. Convert Gender column to category type.

In [25]:
df['Gender'] = df['Gender'].astype('category')
df['Gender'].dtype

CategoricalDtype(categories=['Female', 'Male', 'Other'], ordered=False, categories_dtype=object)

### 46. Convert Location column to category type.

In [29]:
df['Location'] = df['Location'].astype('category')
df['Location'].dtype

CategoricalDtype(categories=['Ahmedabad', 'Bangalore', 'Chennai', 'Dehradun', 'Delhi',
                  'Hyderabad', 'Jaipur', 'Kolkata', 'Lucknow', 'Mumbai',
                  'Other', 'Pune', 'Srinagar', 'Varanasi'],
, ordered=False, categories_dtype=object)

### 47. Check memory usage before and after converting categorical columns.

In [30]:
# Memory usage of entire DataFrame
print("Memory usage before conversion:")
print(df.memory_usage(deep=True))
print("Total:", df.memory_usage(deep=True).sum(), "bytes")

Memory usage before conversion:
Index                        132
CID                       440000
TID                       440000
Gender                     55270
Age Group                2997101
Purchase Date             440000
Product Category         3328417
Discount Name            2489840
Discount Amount (INR)     440000
Gross Amount              440000
Net Amount                440000
Purchase Method          3322398
Location                   56340
dtype: int64
Total: 14889498 bytes

In [32]:
# Example: converting Gender and Age Group to category

categorical_cols = ['Gender', 'Age Group', 'Purchase Method', 'Location']
df[categorical_cols] = df[categorical_cols].astype('category')

In [33]:
print("\nMemory usage after conversion:")
print(df.memory_usage(deep=True))
print("Total:", df.memory_usage(deep=True).sum(), "bytes")

Memory usage after conversion:
Index                        132
CID                       440000
TID                       440000
Gender                     55270
Age Group                  55452
Purchase Date             440000
Product Category         3328417
Discount Name            2489840
Discount Amount (INR)     440000
Gross Amount              440000
Net Amount                440000
Purchase Method            55792
Location                   56340
dtype: int64
Total: 8681243 bytes

### 48. Extract the year from Purchase Date into a new column.

In [35]:
df['Year'] = df['Purchase Date'].dt.year
df[['Purchase Date', 'Year']].head()

        Purchase Date  Year
0 2023-08-30 20:27:08  2023
1 2024-02-23 09:33:46  2024
2 2022-03-06 09:09:50  2022
3 2020-11-04 04:41:57  2020
4 2022-05-31 17:00:32  2022

### 49. Extract the month from Purchase Date into a new column.

In [36]:
df['Month'] = df['Purchase Date'].dt.month
df[['Purchase Date', 'Month']].head()

        Purchase Date  Month
0 2023-08-30 20:27:08      8
1 2024-02-23 09:33:46      2
2 2022-03-06 09:09:50      3
3 2020-11-04 04:41:57     11
4 2022-05-31 17:00:32      5

### 50. Extract the day name from Purchase Date into a new column.

In [37]:
df['Day'] = df['Purchase Date'].dt.day
df[['Purchase Date', 'Day']].head()

        Purchase Date  Day
0 2023-08-30 20:27:08   30
1 2024-02-23 09:33:46   23
2 2022-03-06 09:09:50    6
3 2020-11-04 04:41:57    4
4 2022-05-31 17:00:32   31